#### 必要なライブラリのインポート

In [1]:
import pandas as pd
import numpy as np

#### データの読み込みと代入

In [2]:
df1 = pd.read_csv("running.csv", sep=",", header=0)

#### 3: df1の情報を表示

In [3]:
print(df1.shape)
print(df1.info())
display(df1.head())

(47, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      47 non-null     int64
 1   Univ    47 non-null     object
 2   Grade   47 non-null     int64
 3   Time    47 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade  Time
0  1001    D      3  1870
1  1004    C      1  1957
2  1006    D      2  2063
3  1007    D      3  1839
4  1008    C      2  1740

#### 4: df1のuniv列の値ごとのデータ数

In [4]:
display(df1["Univ"].value_counts())

Univ
A    16
D    15
C     8
B     8
Name: count, dtype: int64

#### 5: df1をtime列の降順にソートしたものをdf2に代入

In [5]:
df2 = df1.sort_values(by="Time", ascending=False)
display(df2.head())

      ID Univ  Grade  Time
11  1015    A      2  2123
5   1009    B      3  2082
2   1006    D      2  2063
17  1021    B      3  2052
6   1010    C      4  2045

#### 6: df2のtime列の値を60で割って単位を分にしたものをMinTime列として追加

In [6]:
df2["MinTIme"] = df2["Time"] / 60
display(df2.head())

      ID Univ  Grade  Time    MinTIme
11  1015    A      2  2123  35.383333
5   1009    B      3  2082  34.700000
2   1006    D      2  2063  34.383333
17  1021    B      3  2052  34.200000
6   1010    C      4  2045  34.083333

#### 7: df2からuniv列を削除したものをdf3へ

In [7]:
df3 = df2.drop(columns="Univ")
display(df3.head())

      ID  Grade  Time    MinTIme
11  1015      2  2123  35.383333
5   1009      3  2082  34.700000
2   1006      2  2063  34.383333
17  1021      3  2052  34.200000
6   1010      4  2045  34.083333